module Common.Phase
where

import Common.Time  (Time)

--------------------------------------------------------------------------------
--  型
--------------------------------------------------------------------------------
-- ゲームの状態遷移を表すデータ。
data Game   = Build     -- ぷよ生成
            | Control   -- プレイヤーの操作
            | Drop      -- ちぎりやぷよ消滅後に起こるぷよ落下
            | Erase     -- ぷよ消滅
            | Erase'
            | Fall      -- おじゃまぷよの落下
            | Fall'
            | GameOver  -- ゲームオーバー
            | Animation Time Game   -- 硬直時間と次の状態遷移
        deriving (Show, Eq)

--------------------------------------------------------------------------------
--  名前
--------------------------------------------------------------------------------
start   = Build     :: Game