module Common.Time
where

--------------------------------------------------------------------------------
--  型
--------------------------------------------------------------------------------
type Time   = Int

--------------------------------------------------------------------------------
--  名前
--------------------------------------------------------------------------------
-- フレームレート。この値が約１秒を表す。
frameRate       = 60    :: Time     -- (60)

-- 入力硬直時間。
inputMoveX      = 6     :: Time     -- ぷよを横移動させたとき。
inputConfig     = 3     :: Time     -- 設定画面でカーソル移動時。

-- アニメーション硬直時間。
animeMove       = 1     :: Time     -- 操作ぷよを移動させたとき。
animeRotate     = 5     :: Time     -- 操作ぷよを回転したとき。
animeLand       = 20    :: Time     -- 操作ぷよを着地させたとき。
animeDrop       = 2     :: Time     -- ちぎり落下のとき。
animeErase      = 40    :: Time     -- ぷよ消滅のとき。


--------------------------------------------------------------------------------
--  関数
--------------------------------------------------------------------------------
count       :: Time -> Time
count time  =  time - signum time